In [1]:
!pip install pandas

/Users/chandu/Desktop/ML_Learnings/datascience/venv/bin/pip: line 2: /Users/chandu/Desktop/ML Learnings/datascience/venv/bin/python3: No such file or directory
/Users/chandu/Desktop/ML_Learnings/datascience/venv/bin/pip: line 2: exec: /Users/chandu/Desktop/ML Learnings/datascience/venv/bin/python3: cannot execute: No such file or directory

In [2]:
import pandas as pd

In [5]:
#series
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
#Create series from a dictionary 
data = {'a':1, 'b':2, 'c': 3}
pd.Series(data)

a    1
b    2
c    3
dtype: int64

In [8]:
#Create series from a list and indexes

data = [1,2,3,4,5]
indexes = ["a","b", "c", "d","e"]
pd.Series(data=data, index=indexes)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
# Create a Data Frame from dict

data = {
    "name":["ram", "shyam", "gopal"],
    "place":["AP","TS", "UP"],
    "age":[25,28,30]
}

pd.DataFrame(data=data)

    name place  age
0    ram    AP   25
1  shyam    TS   28
2  gopal    UP   30

In [20]:
# Create a Data Frame from list of dicts
data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [21]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [24]:
df["Name"]

0    Krish
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

In [26]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [28]:
df.iloc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [30]:
df.at[0,'Age']

32

In [31]:
df.at[2,'Age']

32

In [33]:
df.iat[2,2]

'Bangalore'

In [35]:
## Adding a column
df['Salary']=[50000,60000,70000,10]
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34  Bangalore   60000
2  Bappy   32  Bangalore   70000
3   JAck   32  Bangalore      10

In [40]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       City
1   John   36  Bangalore
2  Bappy   34  Bangalore
3   JAck   34  Bangalore

In [41]:
df

    Name  Age       City
1   John   36  Bangalore
2  Bappy   34  Bangalore
3   JAck   34  Bangalore

In [36]:
df.drop('Salary',axis=1,inplace=True)

In [37]:
df.head()

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [12]:
# Read data form the csv file

df = pd.read_csv('sales_data_for_pandas.csv')

In [13]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [14]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card
6,10007,2024-01-07,Electronics,MacBook Pro 16-inch,1,2499.99,2499.99,North America,Credit Card
7,10008,2024-01-08,Home Appliances,Blueair Classic 480i,2,599.99,1199.98,Europe,PayPal
8,10009,2024-01-09,Clothing,Nike Air Force 1,6,89.99,539.94,Asia,Debit Card

In [16]:
df['Date']

0    2024-01-01
1    2024-01-02
2    2024-01-03
3    2024-01-04
4    2024-01-05
5    2024-01-06
6    2024-01-07
7    2024-01-08
8    2024-01-09
Name: Date, dtype: object

In [17]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [18]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count        9.000000    9.000000     9.000000       9.000000
mean     10005.000000    2.777778   543.990000     805.972222
std          2.738613    1.855921   807.684344     898.873440
min      10001.000000    1.000000    15.990000      63.960000
25%      10003.000000    1.000000    69.990000     149.950000
50%      10005.000000    2.000000    89.990000     499.990000
75%      10007.000000    4.000000   599.990000    1199.980000
max      10009.000000    6.000000  2499.990000    2499.990000

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9 non-null      int64
 1   Date              9 non-null      object
 2   Product Category  9 non-null      object
 3   Product Name      9 non-null      object
 4   Units Sold        9 non-null      int64
 5   Unit Price        9 non-null      float64
 6   Total Revenue     9 non-null      float64
 7   Region            9 non-null      object
 8   Payment Method    9 non-null      object
dtypes: float64(2), int64(2), object(5)
memory usage: 780.0+ bytes